<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Amazon Corretto JDK. Requires ARCH (x64 [Intel], or aarch64 [Apple Silicon]) and MAJOR_VERSION (8,11,17,18).</string>
        <key>Identifier</key>
        <string>com.amazon.aws.download.amazoncorretto</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Amazon Corretto %MAJOR_VERSION%</string>
            <key>MAJOR_VERSION</key>
            <string>8</string>
            <key>ARCH</key>
            <string>x64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>architecture</key>
                    <string>%ARCH%</string>
                    <key>major_version</key>
                    <string>%MAJOR_VERSION%</string>
                </dict>
                <key>Processor</key>
                <string>CorrettoURLGetter</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: AMZN Mobile LLC (94KV3E626L)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
