<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Wickr Enterprise</string>
        <key>Identifier</key>
        <string>com.amazon.aws.download.wickr.enterprise</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Wickr</string>
            <key>api_type</key>
            <string>Enterprise</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict/>
                <key>Processor</key>
                <string>WickrURLProvider</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/WickrEnterprise.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "com.wickr.WickrEnterpriseMac" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = W8RC3R952A)</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
